### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [ ]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [2]:
import pandas

In [3]:
dict1 = {
    'Name': ["Muhammad Ayub", "Ibraheem khan", "Muhammad Abid", "Shumail Khan","Qasim Ali"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["1st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"]
}

In [4]:
df = pandas.DataFrame(dict1)

In [5]:
df = pandas.DataFrame(dict1)

In [6]:
df

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(dict1)

In [9]:
df

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [10]:
pd.__version__

'1.3.5'

## Import to CSV

In [11]:
df.to_csv('pythonMonday.csv')

## Remove Index

In [12]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [13]:
df.head()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [14]:
df.head()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [15]:
df.tail(3)

            Name  Marks     Class
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [16]:
df.tail()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [17]:
df.describe()

           Marks
count   5.000000
mean   61.800000
std    26.771253
min    15.000000
25%    65.000000
50%    72.000000
75%    77.000000
max    80.000000

In [ ]:
dict2 = {
    'Name': ["shahid", "tayyab khan", "abbas khan", "ibrahim","M mazz"],
    'Marks': [3.91, 3.93, 3.6, 2.6, 1.9],
    'Class': ["3rd","4th", "5th", "6th", "7th"]
}
data1 = pd.DataFrame(dict2)
data1.to_csv('data1(studnt).csv')

In [37]:
classData = pd.read_csv('data1(studnt).csv')
classData

          Name   gpa Class
0       shahid  3.91   3rd
1  tayyab khan  3.93   4th
2   abbas khan  3.60   5th
3      ibrahim  2.60   6th
4       M mazz  1.90   7th

In [38]:
classData.drop(0, axis=0)

          Name   gpa Class
1  tayyab khan  3.93   4th
2   abbas khan  3.60   5th
3      ibrahim  2.60   6th
4       M mazz  1.90   7th

In [39]:
classData

          Name   gpa Class
0       shahid  3.91   3rd
1  tayyab khan  3.93   4th
2   abbas khan  3.60   5th
3      ibrahim  2.60   6th
4       M mazz  1.90   7th

In [40]:
classData['gpa']

0    3.91
1    3.93
2    3.60
3    2.60
4    1.90
Name: gpa, dtype: float64

In [42]:
classData['Class']

0    3rd
1    4th
2    5th
3    6th
4    7th
Name: Class, dtype: object

In [181]:
classData['class ']

First     3rd
Second    4th
Third     5th
Fourth    6th
Fifth     7th
Name: class , dtype: object

In [43]:
classData['Name']

0         shahid
1    tayyab khan
2     abbas khan
3        ibrahim
4         M mazz
Name: Name, dtype: object

In [46]:
classData['Name']

0         shahid
1    tayyab khan
2     abbas khan
3        ibrahim
4         M mazz
Name: Name, dtype: object

In [47]:
type(classData['Name'])

pandas.core.series.Series

In [48]:
classData['gpa']

0    3.91
1    3.93
2    3.60
3    2.60
4    1.90
Name: gpa, dtype: float64

In [49]:
classData['gpa'][0]

3.91

In [50]:
classData['gpa'][0]=90

c:\Users\SHAHID\16-Codes\envs\STLF\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [51]:
classData

          Name    gpa Class
0       shahid  90.00   3rd
1  tayyab khan   3.93   4th
2   abbas khan   3.60   5th
3      ibrahim   2.60   6th
4       M mazz   1.90   7th

In [52]:
classData['gpa'][4]

1.9

In [53]:
classData['gpa'][4]=5

c:\Users\SHAHID\16-Codes\envs\STLF\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [56]:
classData["Class"][4]="5th"

c:\Users\SHAHID\16-Codes\envs\STLF\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [57]:
classData

          Name    gpa Class
0       shahid  90.00   3rd
1  tayyab khan   3.93   4th
2   abbas khan   3.60   5th
3      ibrahim   2.60   6th
4       M mazz   5.00   5th

In [60]:
classData["Name"][4]

'M mazz'

In [61]:
classData

          Name    gpa Class
0       shahid  90.00   3rd
1  tayyab khan   3.93   4th
2   abbas khan   3.60   5th
3      ibrahim   2.60   6th
4       M mazz   5.00   5th

In [62]:
classData.to_csv('pythonMondayNew.csv')

In [63]:
classData.to_csv('pythonMondayNewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [64]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [65]:
classData

               Name    gpa Class
First        shahid  90.00   3rd
Second  tayyab khan   3.93   4th
Third    abbas khan   3.60   5th
Fourth      ibrahim   2.60   6th
Fifth        M mazz   5.00   5th

In [66]:
classData["Name"]["Fifth"]

'M mazz'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [67]:
classData['gpa']

First     90.00
Second     3.93
Third      3.60
Fourth     2.60
Fifth      5.00
Name: gpa, dtype: float64

In [68]:
 type(classData['gpa'])

pandas.core.series.Series

In [69]:
classData

               Name    gpa Class
First        shahid  90.00   3rd
Second  tayyab khan   3.93   4th
Third    abbas khan   3.60   5th
Fourth      ibrahim   2.60   6th
Fifth        M mazz   5.00   5th

In [70]:
type(classData)

pandas.core.frame.DataFrame

In [71]:
import numpy as np

In [72]:
series1= pd.Series(np.random.rand())

In [73]:
series1

0    0.318253
dtype: float64

In [74]:
series1= pd.Series(np.random.rand(30))

In [75]:
series1

0     0.528086
1     0.064928
2     0.935267
3     0.334385
4     0.894675
5     0.796756
6     0.817933
7     0.475081
8     0.267357
9     0.752385
10    0.971791
11    0.479425
12    0.130421
13    0.258216
14    0.335134
15    0.831847
16    0.921330
17    0.508143
18    0.956262
19    0.756372
20    0.350651
21    0.041231
22    0.650359
23    0.083001
24    0.891932
25    0.064070
26    0.934345
27    0.484772
28    0.607528
29    0.231092
dtype: float64

In [76]:
type(series1)

pandas.core.series.Series

In [77]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [78]:
type(newDf)

pandas.core.frame.DataFrame

In [79]:
newDf

            0         1         2         3         4
0    0.649675  0.393429  0.513138  0.148071  0.882801
1    0.385780  0.539862  0.215086  0.538730  0.177759
2    0.435884  0.330324  0.415753  0.783783  0.357882
3    0.156893  0.065059  0.388875  0.561804  0.068138
4    0.394894  0.372415  0.289047  0.398517  0.780231
..        ...       ...       ...       ...       ...
325  0.561115  0.061401  0.410752  0.569647  0.643714
326  0.272256  0.352421  0.497207  0.904910  0.358230
327  0.587620  0.340505  0.368695  0.028878  0.471743
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

In [80]:
newDf.head(2)

          0         1         2         3         4
0  0.649675  0.393429  0.513138  0.148071  0.882801
1  0.385780  0.539862  0.215086  0.538730  0.177759

In [81]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [82]:
newDf.tail(2)

            0         1         2         3         4
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

In [83]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [84]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.492486    0.474899    0.504057    0.496854    0.513057
std      0.275216    0.277518    0.293701    0.284506    0.290748
min      0.005473    0.003267    0.000153    0.000298    0.005861
25%      0.272712    0.257354    0.253800    0.255509    0.276811
50%      0.487134    0.448612    0.499120    0.523753    0.523313
75%      0.714541    0.715486    0.770134    0.736302    0.765248
max      0.999933    0.996678    0.997804    0.997978    0.999155

In [85]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [86]:
newDf[0][0]= "Maaz Khan"

In [87]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [88]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.393429  0.513138  0.148071  0.882801
1      0.38578  0.539862  0.215086  0.538730  0.177759
2     0.435884  0.330324  0.415753  0.783783  0.357882
3     0.156893  0.065059  0.388875  0.561804  0.068138
4     0.394894  0.372415  0.289047  0.398517  0.780231
..         ...       ...       ...       ...       ...
325   0.561115  0.061401  0.410752  0.569647  0.643714
326   0.272256  0.352421  0.497207  0.904910  0.358230
327    0.58762  0.340505  0.368695  0.028878  0.471743
328   0.546821  0.310472  0.263364  0.248530  0.999155
329   0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

In [89]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [90]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [91]:
newDf.to_numpy()

array([['Maaz Khan', 0.39342898454052944, 0.5131377743397503,
        0.1480709579516436, 0.8828014759713675],
       [0.38578012266851136, 0.5398624175704322, 0.2150862525181415,
        0.5387299445058115, 0.1777590305764598],
       [0.43588371602209575, 0.3303237803140382, 0.4157525899287382,
        0.7837827949471035, 0.3578818812103838],
       ...,
       [0.5876198038797467, 0.3405049131244401, 0.3686948512132745,
        0.028877652600573067, 0.4717432344151151],
       [0.5468214482540806, 0.3104724917040811, 0.2633642451674809,
        0.24853035630495035, 0.9991551439034047],
       [0.9806205699961507, 0.3936987223493392, 0.8596832441207519,
        0.15845086272989262, 0.32735268182511756]], dtype=object)

In [92]:
newDf[0][0]=0.30

In [93]:
newDf.head()

          0         1         2         3         4
0       0.3  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

In [94]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.38578,0.435884,0.156893,0.394894,0.869579,0.978788,0.277853,0.872081,0.541186,...,0.841093,0.414309,0.005473,0.874423,0.979333,0.561115,0.272256,0.58762,0.546821,0.980621
1,0.393429,0.539862,0.330324,0.065059,0.372415,0.932747,0.64619,0.124671,0.23224,0.462491,...,0.986891,0.021569,0.127006,0.48357,0.518056,0.061401,0.352421,0.340505,0.310472,0.393699
2,0.513138,0.215086,0.415753,0.388875,0.289047,0.117506,0.662949,0.883203,0.618255,0.58284,...,0.772953,0.808297,0.67594,0.195972,0.891969,0.410752,0.497207,0.368695,0.263364,0.859683
3,0.148071,0.53873,0.783783,0.561804,0.398517,0.860179,0.285763,0.561909,0.83357,0.14341,...,0.194158,0.445422,0.023145,0.282608,0.549489,0.569647,0.90491,0.028878,0.24853,0.158451
4,0.882801,0.177759,0.357882,0.068138,0.780231,0.608819,0.887587,0.886499,0.408989,0.130984,...,0.087204,0.409608,0.984816,0.776636,0.573693,0.643714,0.35823,0.471743,0.999155,0.327353

In [95]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.393429  0.513138  0.148071  0.882801
1     0.38578  0.539862  0.215086  0.538730  0.177759
2    0.435884  0.330324  0.415753  0.783783  0.357882
3    0.156893  0.065059  0.388875  0.561804  0.068138
4    0.394894  0.372415  0.289047  0.398517  0.780231
..        ...       ...       ...       ...       ...
325  0.561115  0.061401  0.410752  0.569647  0.643714
326  0.272256  0.352421  0.497207  0.904910  0.358230
327   0.58762  0.340505  0.368695  0.028878  0.471743
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

In [96]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.980621  0.393699  0.859683  0.158451  0.327353
328  0.546821  0.310472  0.263364  0.248530  0.999155
327   0.58762  0.340505  0.368695  0.028878  0.471743
326  0.272256  0.352421  0.497207  0.904910  0.358230
325  0.561115  0.061401  0.410752  0.569647  0.643714
..        ...       ...       ...       ...       ...
4    0.394894  0.372415  0.289047  0.398517  0.780231
3    0.156893  0.065059  0.388875  0.561804  0.068138
2    0.435884  0.330324  0.415753  0.783783  0.357882
1     0.38578  0.539862  0.215086  0.538730  0.177759
0         0.3  0.393429  0.513138  0.148071  0.882801

[330 rows x 5 columns]

In [97]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.393429  0.513138  0.148071  0.882801
1     0.38578  0.539862  0.215086  0.538730  0.177759
2    0.435884  0.330324  0.415753  0.783783  0.357882
3    0.156893  0.065059  0.388875  0.561804  0.068138
4    0.394894  0.372415  0.289047  0.398517  0.780231
..        ...       ...       ...       ...       ...
325  0.561115  0.061401  0.410752  0.569647  0.643714
326  0.272256  0.352421  0.497207  0.904910  0.358230
327   0.58762  0.340505  0.368695  0.028878  0.471743
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

In [98]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.882801  0.148071  0.513138  0.393429       0.3
1    0.177759  0.538730  0.215086  0.539862   0.38578
2    0.357882  0.783783  0.415753  0.330324  0.435884
3    0.068138  0.561804  0.388875  0.065059  0.156893
4    0.780231  0.398517  0.289047  0.372415  0.394894
..        ...       ...       ...       ...       ...
325  0.643714  0.569647  0.410752  0.061401  0.561115
326  0.358230  0.904910  0.497207  0.352421  0.272256
327  0.471743  0.028878  0.368695  0.340505   0.58762
328  0.999155  0.248530  0.263364  0.310472  0.546821
329  0.327353  0.158451  0.859683  0.393699  0.980621

[330 rows x 5 columns]

In [99]:
newDf.head()

          0         1         2         3         4
0       0.3  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

In [100]:
newDf[0][1]

0.38578012266851136

In [101]:
type(newDf[0])

pandas.core.series.Series

In [102]:
newDf

            0         1         2         3         4
0         0.3  0.393429  0.513138  0.148071  0.882801
1     0.38578  0.539862  0.215086  0.538730  0.177759
2    0.435884  0.330324  0.415753  0.783783  0.357882
3    0.156893  0.065059  0.388875  0.561804  0.068138
4    0.394894  0.372415  0.289047  0.398517  0.780231
..        ...       ...       ...       ...       ...
325  0.561115  0.061401  0.410752  0.569647  0.643714
326  0.272256  0.352421  0.497207  0.904910  0.358230
327   0.58762  0.340505  0.368695  0.028878  0.471743
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

## view

In [103]:
newDfView=newDf

In [104]:
newDfView

            0         1         2         3         4
0         0.3  0.393429  0.513138  0.148071  0.882801
1     0.38578  0.539862  0.215086  0.538730  0.177759
2    0.435884  0.330324  0.415753  0.783783  0.357882
3    0.156893  0.065059  0.388875  0.561804  0.068138
4    0.394894  0.372415  0.289047  0.398517  0.780231
..        ...       ...       ...       ...       ...
325  0.561115  0.061401  0.410752  0.569647  0.643714
326  0.272256  0.352421  0.497207  0.904910  0.358230
327   0.58762  0.340505  0.368695  0.028878  0.471743
328  0.546821  0.310472  0.263364  0.248530  0.999155
329  0.980621  0.393699  0.859683  0.158451  0.327353

[330 rows x 5 columns]

In [105]:
newDfView[0][0]=765

c:\Users\SHAHID\16-Codes\envs\STLF\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [106]:
newDf.head()

          0         1         2         3         4
0       765  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

In [107]:
newDfView.head()

          0         1         2         3         4
0       765  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

In [108]:
newDfCopy=newDf.copy()

In [109]:
newDfCopy[0][0]=656

c:\Users\SHAHID\16-Codes\envs\STLF\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [110]:
newDf.head()

          0         1         2         3         4
0       765  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

In [111]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138
4  0.394894  0.372415  0.289047  0.398517  0.780231

## loc

In [112]:
newDf.head(2)

         0         1         2         3         4
0      765  0.393429  0.513138  0.148071  0.882801
1  0.38578  0.539862  0.215086  0.538730  0.177759

In [113]:
newDf.loc[0,0]

765

In [114]:
newDf.loc[0,0]=5678

In [115]:
newDf.head(2)

         0         1         2         3         4
0     5678  0.393429  0.513138  0.148071  0.882801
1  0.38578  0.539862  0.215086  0.538730  0.177759

In [116]:
newDf.loc[0,4]

0.8828014759713675

In [117]:
newDf.loc[325,1]

0.061400730924943026

In [118]:
newDf.loc[0,0]=9875

In [119]:
newDf.head(2)

         0         1         2         3         4
0     9875  0.393429  0.513138  0.148071  0.882801
1  0.38578  0.539862  0.215086  0.538730  0.177759

In [120]:
newDf.columns=list("ABCDE")

In [121]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882

In [122]:
newDf.loc[0, "A"]

9875

In [123]:
newDf.loc[0,"A"]=65

In [124]:
newDf.head(3)

          A         B         C         D         E
0        65  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882

In [125]:
newDf.loc[35,"A"]

0.14337807556155235

In [126]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882
3  0.156893  0.065059  0.388875  0.561804  0.068138

In [127]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.393429  0.513138  0.148071  0.882801
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882

In [128]:
newDf.head(3)

          A         B         C         D         E
0        65  0.393429  0.513138  0.148071  0.882801
1   0.38578  0.539862  0.215086  0.538730  0.177759
2  0.435884  0.330324  0.415753  0.783783  0.357882

In [129]:
newDf = newDf.drop("A", axis=1)

In [130]:
newDf.head(3)

          B         C         D         E
0  0.393429  0.513138  0.148071  0.882801
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882

In [131]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.215086  0.538730
2  0.415753  0.783783

In [132]:
newDf.head(3)

          B         C         D         E
0  0.393429  0.513138  0.148071  0.882801
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882

In [133]:
newDf.loc[:,["C","D"]]

            C         D
0    0.513138  0.148071
1    0.215086  0.538730
2    0.415753  0.783783
3    0.388875  0.561804
4    0.289047  0.398517
..        ...       ...
325  0.410752  0.569647
326  0.497207  0.904910
327  0.368695  0.028878
328  0.263364  0.248530
329  0.859683  0.158451

[330 rows x 2 columns]

In [134]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882

In [135]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.513138  0.148071
1  0.215086  0.538730
2  0.415753  0.783783
3  0.388875  0.561804
4  0.289047  0.398517
5  0.117506  0.860179

In [136]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.539862  0.215086  0.538730
2  0.330324  0.415753  0.783783

In [137]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
3    0.065059  0.388875  0.561804  0.068138
7    0.124671  0.883203  0.561909  0.886499
8    0.232240  0.618255  0.833570  0.408989
11   0.285975  0.519820  0.327085  0.612840
12   0.203710  0.226138  0.744284  0.442727
..        ...       ...       ...       ...
310  0.265005  0.055712  0.205965  0.449134
315  0.022077  0.434281  0.613802  0.110653
321  0.021569  0.808297  0.445422  0.409608
322  0.127006  0.675940  0.023145  0.984816
325  0.061401  0.410752  0.569647  0.643714

[105 rows x 4 columns]

In [138]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
3    0.065059  0.388875  0.561804  0.068138
7    0.124671  0.883203  0.561909  0.886499
8    0.232240  0.618255  0.833570  0.408989
11   0.285975  0.519820  0.327085  0.612840
12   0.203710  0.226138  0.744284  0.442727
..        ...       ...       ...       ...
308  0.046598  0.898518  0.783574  0.279464
310  0.265005  0.055712  0.205965  0.449134
315  0.022077  0.434281  0.613802  0.110653
321  0.021569  0.808297  0.445422  0.409608
325  0.061401  0.410752  0.569647  0.643714

[88 rows x 4 columns]

In [139]:
newDf.head(3)

          B         C         D         E
0  0.393429  0.513138  0.148071  0.882801
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882

## iloc

In [140]:
newDf.iloc[0,0]

0.39342898454052944

In [141]:
newDf.iloc[0,0]=555

In [142]:
newDf.head()

            B         C         D         E
0  555.000000  0.513138  0.148071  0.882801
1    0.539862  0.215086  0.538730  0.177759
2    0.330324  0.415753  0.783783  0.357882
3    0.065059  0.388875  0.561804  0.068138
4    0.372415  0.289047  0.398517  0.780231

In [143]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.513138  0.882801
4  0.289047  0.780231

In [144]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.513138  0.148071  0.882801
1    0.539862  0.215086  0.538730  0.177759
2    0.330324  0.415753  0.783783  0.357882
3    0.065059  0.388875  0.561804  0.068138

In [145]:
newDf.drop(0).head()

          B         C         D         E
1  0.539862  0.215086  0.538730  0.177759
2  0.330324  0.415753  0.783783  0.357882
3  0.065059  0.388875  0.561804  0.068138
4  0.372415  0.289047  0.398517  0.780231
5  0.932747  0.117506  0.860179  0.608819

In [146]:
# newDf.drop(0, axis=1)

In [147]:
# newDf.drop("B", axis=1).head()

In [148]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.882801
1    0.539862  0.177759
2    0.330324  0.357882
3    0.065059  0.068138
4    0.372415  0.780231

In [149]:
newDf.head()

            B         C         D         E
0  555.000000  0.513138  0.148071  0.882801
1    0.539862  0.215086  0.538730  0.177759
2    0.330324  0.415753  0.783783  0.357882
3    0.065059  0.388875  0.561804  0.068138
4    0.372415  0.289047  0.398517  0.780231

In [150]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [151]:
newDf.head()

          C         E
0  0.513138  0.882801
1  0.215086  0.177759
2  0.415753  0.357882
3  0.388875  0.068138
4  0.289047  0.780231

In [152]:
newDf.reset_index().head()

   index         C         E
0      0  0.513138  0.882801
1      1  0.215086  0.177759
2      2  0.415753  0.357882
3      3  0.388875  0.068138
4      4  0.289047  0.780231

In [153]:
newDf.reset_index(drop=True).head()

          C         E
0  0.513138  0.882801
1  0.215086  0.177759
2  0.415753  0.357882
3  0.388875  0.068138
4  0.289047  0.780231

In [154]:
newDf.head()

          C         E
0  0.513138  0.882801
1  0.215086  0.177759
2  0.415753  0.357882
3  0.388875  0.068138
4  0.289047  0.780231

In [155]:
newDf.reset_index(drop=True, inplace=True)

In [156]:
newDf.head()

          C         E
0  0.513138  0.882801
1  0.215086  0.177759
2  0.415753  0.357882
3  0.388875  0.068138
4  0.289047  0.780231

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [157]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [158]:
df = pd.DataFrame(data)

In [159]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [160]:
df.groupby('Company')

##### You can save this object as a new variable:

In [161]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [162]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [163]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [164]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [165]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [166]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [167]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [168]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0